mtosi1.1-TestSuite/TestsDefinitions/Notifications/examples/Notification_notify_objectCreation.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns="tmf854.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="tmf854.v1 ../../../../xsd/common/Header.xsd tmf854.v1 ../../../../xsd/interfaces/ManagedElementMgr.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<header tmf854Version="1.1">
			<activityName>notify</activityName>
			<msgName>notify</msgName>
			<msgType>NOTIFICATION</msgType>
			<senderURI>/MTOSI/EMS01</senderURI>
			<destinationURI>/MTOSI/BrokerOS</destinationURI>
			<communicationPattern>Notification</communicationPattern>
			<communicationStyle>MSG</communicationStyle>
			<timestamp>20051004140305</timestamp>
		</header>
	</soap:Header>
	<soap:Body>
		<notify tmf854Version="1.1">
			<topic>Inventory</topic>
			<message>
				<ObjectCreation>
					<eventInfo>
						<notificationId>00012013</notificationId>
						<objectName>
							<mdNm>Networks/XdrEMS/Server1 </mdNm>
							<meNm>4571</meNm>
						</objectName>
						<objectType>OT_MANAGED_ELEMENT</objectType>
						<osTime>20041106210627.3</osTime>
					</eventInfo>
				</ObjectCreation>
			</message>
		</notify>
	</soap:Body>
</soap:Envelope>
